antongus/stm32tpl/stm32_uart_driver.h
/**
 *  stm32tpl --  STM32 C++ Template Peripheral Library
 *  Visit https://github.com/antongus/stm32tpl for new versions
 *
 *  Copyright (c) 2011-2020 Anton B. Gusev aka AHTOXA
 *
 *  Permission is hereby granted, free of charge, to any person obtaining a copy
 *  of this software and associated documentation files (the "Software"), to deal
 *  in the Software without restriction, including without limitation the rights
 *  to use, copy, modify, merge, publish, distribute, sublicense, and/or sell
 *  copies of the Software, and to permit persons to whom the Software is
 *  furnished to do so, subject to the following conditions:
 *
 *  The above copyright notice and this permission notice shall be included in
 *  all copies or substantial portions of the Software.
 *
 *  THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
 *  IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
 *  FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE
 *  AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER
 *  LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,
 *  OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN
 *  THE SOFTWARE.
 *
 *
 *  @file         : stm32_uart_driver.h
 *  @description  : STM32 USART module driver.
 *  created on    : 09.11.2010
 *
 */

#ifndef STM32TPL_STM32_UART_DRIVER_H_INCLUDED
#define STM32TPL_STM32_UART_DRIVER_H_INCLUDED

#include "stm32.h"
#include "pin.h"

namespace STM32
{
namespace UART
{
typedef uint32_t Baudrate;

/**
*  @brief enum for UART device selection
*/
enum UartNum
{
#if (defined RCC_APB2ENR_USART1EN)
	UART_1,
#endif
#if (defined RCC_APB1ENR_USART2EN) || (defined RCC_APB1LENR_USART2EN)
	UART_2,
#endif
#if (defined RCC_APB1ENR_USART3EN) || (defined RCC_APB1LENR_USART3EN)
	UART_3,
#endif
#if (defined RCC_APB1ENR_UART4EN) || (defined RCC_APB1ENR_USART4EN) || (defined RCC_APB1LENR_UART4EN)
	UART_4,
#endif
#if (defined RCC_APB1ENR_UART5EN) || (defined RCC_APB1ENR_USART5EN) || (defined RCC_APB1LENR_UART5EN)
	UART_5,
#endif
#if (defined RCC_APB2ENR_USART6EN)
	UART_6,
#endif
#if (defined RCC_APB1ENR_UART7EN) || (defined RCC_APB1LENR_UART7EN)
	UART_7,
#endif
#if (defined RCC_APB1ENR_UART8EN) || (defined RCC_APB1LENR_UART8EN)
	UART_8,
#endif
#if (defined RCC_APB1ENR_LPUART1EN) || (defined RCC_APB4ENR_LPUART1EN)
	LPUART_1,
#endif
};

/**
*  @brief enum for remap state
*/
enum Remap { REMAP_NONE, REMAP_FULL, REMAP_PARTIAL, REMAP_PARTIAL2 };

namespace
{
/**
*  @brief UART pins selection template. Used internally.
*/
template<UartNum uartNum, Remap remapped = REMAP_NONE> struct UartPinSet;

#if (defined RCC_APB2ENR_USART1EN)
template<> struct UartPinSet<UART_1>
{
	typedef Pin<'A', 9> PinTX;
	typedef Pin<'A', 10> PinRX;
#if (defined STM32TPL_F2xxF4xx) || (defined STM32TPL_STM32L1XX) || (defined STM32TPL_STM32F7XX) || (defined STM32TPL_STM32H7XX)
	static const PinAltFunction ALT_FUNC_USARTx = ALT_FUNC_USART1;
#elif (defined STM32TPL_STM32L0XX)
	static const PinAltFunction ALT_FUNC_USARTx = ALT_FUNC_4;
#elif (defined STM32TPL_STM32F0XX)
	static const PinAltFunction ALT_FUNC_USARTx = ALT_FUNC_1;
#elif (defined STM32TPL_STM32F3XX)
	static const PinAltFunction ALT_FUNC_USARTx = ALT_FUNC_7;
#endif
};

#if (defined STM32TPL_STM32F3XX)
template<> struct UartPinSet<UART_1, REMAP_PARTIAL>
{
	typedef Pin<'C', 4> PinTX;
	typedef Pin<'C', 5> PinRX;
	static const PinAltFunction ALT_FUNC_USARTx = ALT_FUNC_7;
};
#endif

template<> struct UartPinSet<UART_1, REMAP_FULL>
{
	typedef Pin<'B', 6> PinTX;
	typedef Pin<'B', 7> PinRX;
#if (defined STM32TPL_F2xxF4xx) || (defined STM32TPL_STM32L1XX) || (defined STM32TPL_STM32F7XX) || (defined STM32TPL_STM32H7XX)
	static const PinAltFunction ALT_FUNC_USARTx = ALT_FUNC_USART1;
#elif (defined STM32TPL_STM32L0XX)
	static const PinAltFunction ALT_FUNC_USARTx = ALT_FUNC_0;
#elif (defined STM32TPL_STM32F0XX)
	static const PinAltFunction ALT_FUNC_USARTx = ALT_FUNC_0;
#elif (defined STM32TPL_STM32F3XX)
	static const PinAltFunction ALT_FUNC_USARTx = ALT_FUNC_7;
#endif
};
#endif

#if (defined RCC_APB1ENR_USART2EN) || (defined RCC_APB1LENR_USART2EN)
template<> struct UartPinSet<UART_2>
{
	typedef Pin<'A', 2> PinTX;
	typedef Pin<'A', 3> PinRX;
#if (defined STM32TPL_F2xxF4xx) || (defined STM32TPL_STM32L1XX) || (defined STM32TPL_STM32F7XX) || (defined STM32TPL_STM32H7XX)
	static const PinAltFunction ALT_FUNC_USARTx = ALT_FUNC_USART2;
#elif (defined STM32TPL_STM32L0XX)
	static const PinAltFunction ALT_FUNC_USARTx = ALT_FUNC_4;
#elif (defined STM32TPL_STM32F0XX)
	static const PinAltFunction ALT_FUNC_USARTx = ALT_FUNC_1;
#elif (defined STM32TPL_STM32F3XX)
	static const PinAltFunction ALT_FUNC_USARTx = ALT_FUNC_7;
#endif
};

#if (defined STM32TPL_STM32F3XX) || (defined STM32TPL_STM32H7XX)
template<> struct UartPinSet<UART_2, REMAP_PARTIAL>
{
	typedef Pin<'D', 5> PinTX;
	typedef Pin<'D', 6> PinRX;
	static const PinAltFunction ALT_FUNC_USARTx = ALT_FUNC_7;
};
#endif

#if (defined STM32TPL_STM32L0XX)
template<> struct UartPinSet<UART_2, REMAP_PARTIAL>
{
	typedef Pin<'A', 9> PinTX;
	typedef Pin<'A', 10> PinRX;
	static const PinAltFunction ALT_FUNC_USARTx = ALT_FUNC_4;
};
#endif

template<> struct UartPinSet<UART_2, REMAP_FULL>
{
#if (defined STM32TPL_STM32L0XX) || (defined STM32TPL_STM32F0XX) || (defined STM32TPL_STM32F3XX)
	typedef Pin<'A', 14> PinTX;
	typedef Pin<'A', 15> PinRX;
#else
	typedef Pin<'D', 5> PinTX;
	typedef Pin<'D', 6> PinRX;
#endif
#if (defined STM32TPL_F2xxF4xx) || (defined STM32TPL_STM32L1XX)  || (defined STM32TPL_STM32F7XX) || (defined STM32TPL_STM32H7XX)
	static const PinAltFunction ALT_FUNC_USARTx = ALT_FUNC_USART2;
#elif (defined STM32TPL_STM32L0XX)
	static const PinAltFunction ALT_FUNC_USARTx = ALT_FUNC_4;
#elif (defined STM32TPL_STM32F0XX)
	static const PinAltFunction ALT_FUNC_USARTx = ALT_FUNC_1;
#elif (defined STM32TPL_STM32F3XX)
	static const PinAltFunction ALT_FUNC_USARTx = ALT_FUNC_7;
#endif
};
#endif

#if (defined RCC_APB1ENR_USART3EN) || (defined RCC_APB1LENR_USART3EN)
template<> struct UartPinSet<UART_3>
{
	typedef Pin<'B', 10> PinTX;
	typedef Pin<'B', 11> PinRX;
#if (defined STM32TPL_F2xxF4xx) || (defined STM32TPL_STM32L1XX)  || (defined STM32TPL_STM32F7XX) || (defined STM32TPL_STM32H7XX)
	static const PinAltFunction ALT_FUNC_USARTx = ALT_FUNC_USART3;
#elif (defined STM32TPL_STM32F0XX)
	static const PinAltFunction ALT_FUNC_USARTx = ALT_FUNC_4;
#elif (defined STM32TPL_STM32F3XX)
	static const PinAltFunction ALT_FUNC_USARTx = ALT_FUNC_7;
#endif
};

