antongus/stm32tpl/stm32_uart_driver.h
template<> struct UartPinSet<UART_3, REMAP_PARTIAL>
{
	typedef Pin<'C', 10> PinTX;
	typedef Pin<'C', 11> PinRX;
#if (defined STM32TPL_F2xxF4xx) || (defined STM32TPL_STM32L1XX)  || (defined STM32TPL_STM32F7XX) || (defined STM32TPL_STM32H7XX)
	static const PinAltFunction ALT_FUNC_USARTx = ALT_FUNC_USART3;
#elif (defined STM32TPL_STM32F0XX)
	static const PinAltFunction ALT_FUNC_USARTx = ALT_FUNC_1;
#elif (defined STM32TPL_STM32F3XX)
	static const PinAltFunction ALT_FUNC_USARTx = ALT_FUNC_7;
#endif
};

#if (defined STM32TPL_STM32F0XX)
template<> struct UartPinSet<UART_3, REMAP_PARTIAL2>
{
	typedef Pin<'C', 4> PinTX;
	typedef Pin<'C', 5> PinRX;
	static const PinAltFunction ALT_FUNC_USARTx = ALT_FUNC_1;
};
#endif

template<> struct UartPinSet<UART_3, REMAP_FULL>
{
	typedef Pin<'D', 8> PinTX;
	typedef Pin<'D', 9> PinRX;
#if (defined STM32TPL_F2xxF4xx) || (defined STM32TPL_STM32L1XX)  || (defined STM32TPL_STM32F7XX) || (defined STM32TPL_STM32H7XX)
	static const PinAltFunction ALT_FUNC_USARTx = ALT_FUNC_USART3;
#elif (defined STM32TPL_STM32F0XX)
	static const PinAltFunction ALT_FUNC_USARTx = ALT_FUNC_0;
#elif (defined STM32TPL_STM32F3XX)
	static const PinAltFunction ALT_FUNC_USARTx = ALT_FUNC_7;
#endif
};
#endif  // #if (UART_COUNT > 2)

#if (defined RCC_APB1ENR_UART4EN) || (defined RCC_APB1ENR_USART4EN) || (defined RCC_APB1LENR_UART4EN)
template<> struct UartPinSet<UART_4>
{
	typedef Pin<'C', 10> PinTX;
	typedef Pin<'C', 11> PinRX;
#if (defined STM32TPL_F2xxF4xx) || (defined STM32TPL_STM32L1XX)  || (defined STM32TPL_STM32F7XX) || (defined STM32TPL_STM32H7XX)
	static const PinAltFunction ALT_FUNC_USARTx = ALT_FUNC_UART4;
#elif (defined STM32TPL_STM32F0XX)
	static const PinAltFunction ALT_FUNC_USARTx = ALT_FUNC_0;
#elif (defined STM32TPL_STM32F3XX)
	static const PinAltFunction ALT_FUNC_USARTx = ALT_FUNC_5;
#endif
};

#if (defined STM32TPL_STM32H7XX)
template<> struct UartPinSet<UART_4, REMAP_PARTIAL>
{
	typedef Pin<'D', 1> PinTX;
	typedef Pin<'D', 0> PinRX;
	static const PinAltFunction ALT_FUNC_USARTx = ALT_FUNC_UART4;
};
template<> struct UartPinSet<UART_4, REMAP_PARTIAL2>
{
	typedef Pin<'A', 0> PinTX;
	typedef Pin<'A', 1> PinRX;
	static const PinAltFunction ALT_FUNC_USARTx = ALT_FUNC_UART4;
};
template<> struct UartPinSet<UART_4, REMAP_FULL>
{
	typedef Pin<'H', 13> PinTX;
	typedef Pin<'H', 14> PinRX;
	static const PinAltFunction ALT_FUNC_USARTx = ALT_FUNC_UART4;
};
#endif

#if (defined STM32TPL_STM32F0XX)
template<> struct UartPinSet<UART_4, REMAP_FULL>
{
	typedef Pin<'A', 0> PinTX;
	typedef Pin<'A', 11> PinRX;
	static const PinAltFunction ALT_FUNC_USARTx = ALT_FUNC_4;
};
#endif

#endif  // UART4EN

#if (defined RCC_APB1ENR_UART5EN) || (defined RCC_APB1ENR_USART5EN)
template<> struct UartPinSet<UART_5>
{
	typedef Pin<'C', 12> PinTX;
	typedef Pin<'D', 2> PinRX;
#if (defined STM32TPL_F2xxF4xx) || (defined STM32TPL_STM32L1XX)
	static const PinAltFunction ALT_FUNC_USARTx = ALT_FUNC_UART5;
#elif (defined STM32TPL_STM32F3XX)
	static const PinAltFunction ALT_FUNC_USARTx = ALT_FUNC_5;
#endif
};
#endif

#if (defined RCC_APB2ENR_USART6EN)
template<> struct UartPinSet<UART_6>
{
	typedef Pin<'C', 6> PinTX;
	typedef Pin<'C', 7> PinRX;
#if (defined STM32TPL_F2xxF4xx) || (defined STM32TPL_STM32L1XX)
	static const PinAltFunction ALT_FUNC_USARTx = ALT_FUNC_USART6;
#endif
};

template<> struct UartPinSet<UART_6, REMAP_FULL>
{
	typedef Pin<'G', 14> PinTX;
	typedef Pin<'G', 9> PinRX;
#if (defined STM32TPL_F2xxF4xx) || (defined STM32TPL_STM32L1XX)
	static const PinAltFunction ALT_FUNC_USARTx = ALT_FUNC_USART6;
#endif
};
#endif

#if (defined RCC_APB1ENR_UART7EN) || (defined RCC_APB1LENR_UART7EN)
template<> struct UartPinSet<UART_7>
{
	typedef Pin<'B', 4> PinTX;
	typedef Pin<'B', 3> PinRX;
	static const PinAltFunction ALT_FUNC_USARTx = ALT_FUNC_11;
};

#if (defined STM32TPL_STM32H7XX)
template<> struct UartPinSet<UART_7, REMAP_PARTIAL>
{
	typedef Pin<'F', 7> PinTX;
	typedef Pin<'F', 6> PinRX;
	static const PinAltFunction ALT_FUNC_USARTx = ALT_FUNC_7;
};
template<> struct UartPinSet<UART_7, REMAP_PARTIAL2>
{
	typedef Pin<'A', 15> PinTX;
	typedef Pin<'A', 8> PinRX;
	static const PinAltFunction ALT_FUNC_USARTx = ALT_FUNC_11;
};
template<> struct UartPinSet<UART_7, REMAP_FULL>
{
	typedef Pin<'E', 8> PinTX;
	typedef Pin<'E', 7> PinRX;
	static const PinAltFunction ALT_FUNC_USARTx = ALT_FUNC_7;
};
#endif

#endif  // UART7EN

#if (defined RCC_APB1ENR_LPUART1EN)
template<> struct UartPinSet<LPUART_1, REMAP_NONE>
{
	typedef Pin<'C', 4> PinTX;
	typedef Pin<'C', 5> PinRX;
	static const PinAltFunction ALT_FUNC_USARTx = ALT_FUNC_2;
};

template<> struct UartPinSet<LPUART_1, REMAP_PARTIAL>
{
	typedef Pin<'C', 10> PinTX;
	typedef Pin<'C', 11> PinRX;
	static const PinAltFunction ALT_FUNC_USARTx = ALT_FUNC_0;
};

template<> struct UartPinSet<LPUART_1, REMAP_FULL>
{
	typedef Pin<'B', 10> PinTX;
	typedef Pin<'B', 11> PinRX;
	static const PinAltFunction ALT_FUNC_USARTx = ALT_FUNC_4;
};
#endif
}

template<UartNum uartNum, Remap remapped = REMAP_NONE>
struct UartPins
{
	using PinSet = UartPinSet<uartNum, remapped>;
	using PinTX = typename PinSet::PinTX;
	using PinRX = typename PinSet::PinRX;
#if (!defined STM32TPL_STM32F1XX)
	static const PinAltFunction ALT_FUNC_USARTx = PinSet::ALT_FUNC_USARTx;
#endif

	static void Init()
	{
#if (defined STM32TPL_STM32F1XX)
		PinTX::Mode(ALT_OUTPUT);
		PinRX::Mode(INPUTPULLED);
		PinRX::PullUp();
#else
		PinTX::Alternate(ALT_FUNC_USARTx);
		PinRX::Alternate(ALT_FUNC_USARTx);
		PinTX::Mode(ALT_OUTPUT);
		PinRX::Mode(ALT_INPUT_PULLUP);
#endif
	}

	static void DeInit()
	{
#if (defined STM32TPL_STM32F1XX)
		PinTX::Mode(ANALOGINPUT);
		PinRX::Mode(ANALOGINPUT);
		PinRX::PullUp();
#else
		PinTX::Alternate((PinAltFunction)0);
		PinRX::Alternate((PinAltFunction)0);
		PinTX::Mode(INPUT);
		PinRX::Mode(INPUT);
		PinRX::PullNone();
#endif
	}
};


/**
*  UART traits template.
*/
template<UartNum uartNum> struct UartTraits;

#if (defined RCC_APB2ENR_USART1EN)
template<> struct UartTraits<UART_1>
{
	static const IRQn USARTx_IRQn  = USART1_IRQn;
	enum
	{
		USARTx_BASE               = USART1_BASE,
#if (defined AFIO_MAPR_USART1_REMAP)
		USARTx_REMAP              = AFIO_MAPR_USART1_REMAP,
#else
		USARTx_REMAP              = 0,
#endif
		USARTx_REMAP_PARTIAL      = 0,
		BUS_FREQ                  = chip::APB2_FREQ,
		BUS_FREQ_MUL              = 1,
	};
	INLINE static void EnableClocks()  { RCC->APB2ENR |= RCC_APB2ENR_USART1EN;  __DSB(); }
	INLINE static void DisableClocks() { RCC->APB2ENR &= ~RCC_APB2ENR_USART1EN; __DSB(); }
	INLINE static void Reset()         { RCC->APB2RSTR |= RCC_APB2RSTR_USART1RST; RCC->APB2RSTR &= ~RCC_APB2RSTR_USART1RST; }
};
#endif

#if (defined RCC_APB1ENR_USART2EN)
template<> struct UartTraits<UART_2>
{
	static const IRQn USARTx_IRQn  = USART2_IRQn;
	enum
	{
		USARTx_BASE               = USART2_BASE,
#if (defined AFIO_MAPR_USART2_REMAP)
		USARTx_REMAP              = AFIO_MAPR_USART2_REMAP,
#else
		USARTx_REMAP              = 0,
#endif
		USARTx_REMAP_PARTIAL      = 0,
		BUS_FREQ                  = chip::APB1_FREQ,
		BUS_FREQ_MUL              = 1,
	};
	INLINE static void EnableClocks()  { RCC->APB1ENR |= RCC_APB1ENR_USART2EN;  __DSB(); }
	INLINE static void DisableClocks() { RCC->APB1ENR &= ~RCC_APB1ENR_USART2EN; __DSB(); }
	INLINE static void Reset()         { RCC->APB1RSTR |= RCC_APB1RSTR_USART2RST; RCC->APB1RSTR &= ~RCC_APB1RSTR_USART2RST; }
};
#endif

#if (defined RCC_APB1ENR_USART3EN)
template<> struct UartTraits<UART_3>
{
#if (defined STM32TPL_STM32F0XX)
	static const IRQn USARTx_IRQn  = USART3_4_IRQn;
#else
	static const IRQn USARTx_IRQn  = USART3_IRQn;
#endif
	enum
	{
		USARTx_BASE               = USART3_BASE,
#if (defined AFIO_MAPR_USART3_REMAP)
		USARTx_REMAP              = AFIO_MAPR_USART3_REMAP,
		USARTx_REMAP_PARTIAL      = AFIO_MAPR_USART3_REMAP_0,
#else
		USARTx_REMAP              = 0,
		USARTx_REMAP_PARTIAL      = 0,
#endif
		BUS_FREQ                  = chip::APB1_FREQ,
		BUS_FREQ_MUL              = 1,
	};
	INLINE static void EnableClocks()  { RCC->APB1ENR |= RCC_APB1ENR_USART3EN;  __DSB(); }
	INLINE static void DisableClocks() { RCC->APB1ENR &= ~RCC_APB1ENR_USART3EN; __DSB(); }
	INLINE static void Reset()         { RCC->APB1RSTR |= RCC_APB1RSTR_USART3RST; RCC->APB1RSTR &= ~RCC_APB1RSTR_USART3RST; }
};
#endif

