antongus/stm32tpl/stm32_uart_driver.h
#if (defined RCC_APB1ENR_UART4EN) || (defined RCC_APB1ENR_USART4EN)
#if (defined STM32TPL_STM32F0XX)
template<> struct UartTraits<UART_4>
{
	static const IRQn USARTx_IRQn  = USART3_4_IRQn;
	enum
	{
		USARTx_BASE               = USART4_BASE,
		USARTx_REMAP              = 0,
		USARTx_REMAP_PARTIAL      = 0,
		BUS_FREQ                  = chip::APB1_FREQ,
		BUS_FREQ_MUL              = 1,
	};
	INLINE static void EnableClocks()  { RCC->APB1ENR |= RCC_APB1ENR_USART4EN;  __DSB(); }
	INLINE static void DisableClocks() { RCC->APB1ENR &= ~RCC_APB1ENR_USART4EN; __DSB(); }
	INLINE static void Reset()         { RCC->APB1RSTR |= RCC_APB1RSTR_USART4RST; RCC->APB1RSTR &= ~RCC_APB1RSTR_USART4RST; }
};
#elif (defined STM32TPL_STM32L0XX)
template<> struct UartTraits<UART_4>
{
	static const IRQn USARTx_IRQn  = USART4_5_IRQn;
	enum
	{
		USARTx_BASE               = USART4_BASE,
		USARTx_REMAP              = 0,
		USARTx_REMAP_PARTIAL      = 0,
		BUS_FREQ                  = chip::APB1_FREQ,
		BUS_FREQ_MUL              = 1,
	};
	INLINE static void EnableClocks()  { RCC->APB1ENR |= RCC_APB1ENR_USART4EN;  __DSB(); }
	INLINE static void DisableClocks() { RCC->APB1ENR &= ~RCC_APB1ENR_USART4EN; __DSB(); }
	INLINE static void Reset()         { RCC->APB1RSTR |= RCC_APB1RSTR_USART4RST; RCC->APB1RSTR &= ~RCC_APB1RSTR_USART4RST; }
};
#else
template<> struct UartTraits<UART_4>
{
	static const IRQn USARTx_IRQn  = UART4_IRQn;
	enum
	{
		USARTx_BASE               = UART4_BASE,
		USARTx_REMAP              = 0,
		USARTx_REMAP_PARTIAL      = 0,
		BUS_FREQ                  = chip::APB1_FREQ,
		BUS_FREQ_MUL              = 1,
	};
	INLINE static void EnableClocks()  { RCC->APB1ENR |= RCC_APB1ENR_UART4EN;  __DSB(); }
	INLINE static void DisableClocks() { RCC->APB1ENR &= ~RCC_APB1ENR_UART4EN; __DSB(); }
	INLINE static void Reset()         { RCC->APB1RSTR |= RCC_APB1RSTR_UART4RST; RCC->APB1RSTR &= ~RCC_APB1RSTR_UART4RST; }
};
#endif
#endif

#if (defined RCC_APB1ENR_UART5EN) || (defined RCC_APB1ENR_USART5EN)
#if (defined STM32TPL_STM32L0XX)
template<> struct UartTraits<UART_5>
{
	static const IRQn USARTx_IRQn  = USART4_5_IRQn;
	enum
	{
		USARTx_BASE               = USART5_BASE,
		USARTx_REMAP              = 0,
		USARTx_REMAP_PARTIAL      = 0,
		BUS_FREQ                  = chip::APB1_FREQ,
		BUS_FREQ_MUL              = 1,
	};
	INLINE static void EnableClocks()  { RCC->APB1ENR |= RCC_APB1ENR_USART5EN;  __DSB(); }
	INLINE static void DisableClocks() { RCC->APB1ENR &= ~RCC_APB1ENR_USART5EN; __DSB(); }
	INLINE static void Reset()         { RCC->APB1RSTR |= RCC_APB1RSTR_USART5RST; RCC->APB1RSTR &= ~RCC_APB1RSTR_USART5RST; }
};
#else
template<> struct UartTraits<UART_5>
{
	static const IRQn USARTx_IRQn  = UART5_IRQn;
	enum
	{
		USARTx_BASE               = UART5_BASE,
		USARTx_REMAP              = 0,
		USARTx_REMAP_PARTIAL      = 0,
		BUS_FREQ                  = chip::APB1_FREQ,
		BUS_FREQ_MUL              = 1,
	};
	INLINE static void EnableClocks()  { RCC->APB1ENR |= RCC_APB1ENR_UART5EN;  __DSB(); }
	INLINE static void DisableClocks() { RCC->APB1ENR &= ~RCC_APB1ENR_UART5EN; __DSB(); }
	INLINE static void Reset()         { RCC->APB1RSTR |= RCC_APB1RSTR_UART5RST; RCC->APB1RSTR &= ~RCC_APB1RSTR_UART5RST; }
};
#endif
#endif

#if (defined RCC_APB2ENR_USART6EN)
template<> struct UartTraits<UART_6>
{
	static const IRQn USARTx_IRQn  = USART6_IRQn;
	enum
	{
		USARTx_BASE               = USART6_BASE,
		USARTx_REMAP              = 0,
		USARTx_REMAP_PARTIAL      = 0,
		BUS_FREQ                  = chip::APB2_FREQ,
		BUS_FREQ_MUL              = 1,
	};
	INLINE static void EnableClocks()  { RCC->APB2ENR |= RCC_APB2ENR_USART6EN;  __DSB(); }
	INLINE static void DisableClocks() { RCC->APB2ENR &= ~RCC_APB2ENR_USART6EN; __DSB(); }
	INLINE static void Reset()         { RCC->APB2RSTR |= RCC_APB2RSTR_USART6RST; RCC->APB2RSTR &= ~RCC_APB2RSTR_USART6RST; }
};
#endif

#if (defined RCC_APB1LENR_UART7EN)
template<> struct UartTraits<UART_7>
{
	static const IRQn USARTx_IRQn  = UART7_IRQn;
	enum
	{
		USARTx_BASE               = UART7_BASE,
		USARTx_REMAP              = 0,
		USARTx_REMAP_PARTIAL      = 0,
		BUS_FREQ                  = chip::APB1_FREQ,
		BUS_FREQ_MUL              = 1,
	};
	INLINE static void EnableClocks()  { RCC->APB1LENR |= RCC_APB1LENR_UART7EN;  __DSB(); }
	INLINE static void DisableClocks() { RCC->APB1LENR &= ~RCC_APB1LENR_UART7EN; __DSB(); }
	INLINE static void Reset()         { RCC->APB1LRSTR |= RCC_APB1LRSTR_UART7RST; RCC->APB1LRSTR &= ~RCC_APB1LRSTR_UART7RST; }
};
#endif

#if (defined RCC_APB1ENR_LPUART1EN)
template<> struct UartTraits<LPUART_1>
{
	static const IRQn USARTx_IRQn  = RNG_LPUART1_IRQn;
	enum
	{
		USARTx_BASE               = LPUART1_BASE,
		USARTx_REMAP              = 0,
		USARTx_REMAP_PARTIAL      = 0,
		BUS_FREQ                  = chip::APB1_FREQ,
		BUS_FREQ_MUL              = 256,
	};
	INLINE static void EnableClocks()  { RCC->APB1ENR |= RCC_APB1ENR_LPUART1EN;  __DSB(); }
	INLINE static void DisableClocks() { RCC->APB1ENR &= ~RCC_APB1ENR_LPUART1EN; __DSB(); }
	INLINE static void Reset()         { RCC->APB1RSTR |= RCC_APB1RSTR_LPUART1RST; RCC->APB1RSTR &= ~RCC_APB1RSTR_LPUART1RST; }
};
#endif

/**
 * Dummy DE pin.
 * Used as DE pin when no DE pin needed.
 */
struct DummyDE
{
	INLINE static void On() { }
	INLINE static void Off() { }
	INLINE static void Cpl() { }
	INLINE static void Mode(direction) { }
	INLINE static int Latched() { return true; }
};

/**
 * Combined DE+RE pin.
 * Used as DE pin when DE and RE pins are separated.
 */
template <typename DePin, typename RePin>
struct CombinedDeRe
{
	INLINE static void On() { DePin::On(); RePin::On(); }
	INLINE static void Off() { DePin::Off(); RePin::Off(); }
	INLINE static void Cpl() { DePin::Cpl(); RePin::Cpl(); }
	INLINE static void Mode(direction dir) { DePin::Mode(dir); RePin::Mode(dir); }
	INLINE static int Latched() { return DePin::Latched(); }
};

/**
 * USART peripheral registers for STM32TPL_STM32L0XX chips.
 */
#if (defined STM32TPL_STM32L0XX) || (defined STM32TPL_STM32F0XX) || (defined STM32TPL_STM32F3XX) || (defined STM32TPL_STM32H7XX)
struct USARTx_TypeDef
{
	volatile uint32_t CR1;
	volatile uint32_t CR2;
	volatile uint32_t CR3;
	volatile uint32_t BRR;
	volatile uint32_t GTPR;
	volatile uint32_t RTOR;
	volatile uint32_t RQR;
	volatile uint32_t ISR;
	volatile uint32_t ICR;
	volatile uint32_t RDR;
	volatile uint32_t TDR;
#if (defined STM32TPL_STM32H7XX)
	volatile uint32_t PRESC;
#endif
};

/**
 * USART status flags for STM32TPL_STM32L0XX chips.
 * Defined here because of inconsistency of this names in ST headers
 */
enum : uint32_t
{
	USART_FLAG_PE     = 0x00000001UL,
	USART_FLAG_FE     = 0x00000002UL,
	USART_FLAG_NE     = 0x00000004UL,
	USART_FLAG_ORE    = 0x00000008UL,
	USART_FLAG_IDLE   = 0x00000010UL,
	USART_FLAG_RXNE   = 0x00000020UL,
	USART_FLAG_TC     = 0x00000040UL,
	USART_FLAG_TXE    = 0x00000080UL,
	USART_FLAG_LBD    = 0x00000100UL,
	USART_FLAG_CTSIF  = 0x00000200UL,
	USART_FLAG_CTS    = 0x00000400UL,
	USART_FLAG_RTOF   = 0x00000800UL,
	USART_FLAG_EOBF   = 0x00001000UL,
	USART_FLAG_ABRE   = 0x00004000UL,
	USART_FLAG_ABRF   = 0x00008000UL,
	USART_FLAG_BUSY   = 0x00010000UL,
	USART_FLAG_CMF    = 0x00020000UL,
	USART_FLAG_SBKF   = 0x00040000UL,
	USART_FLAG_RWU    = 0x00080000UL,
	USART_FLAG_WUF    = 0x00100000UL,
	USART_FLAG_TEACK  = 0x00200000UL,
	USART_FLAG_REACK  = 0x00400000UL,
};

#else

/**
 * USART peripheral registers for all other chips.
 */
struct USARTx_TypeDef
{
	volatile uint16_t SR;
	uint16_t reserved0;
	volatile uint16_t DR;
	uint16_t reserved1;
	volatile uint16_t BRR;
	uint16_t reserved2;
	volatile uint16_t CR1;
	uint16_t reserved3;
	volatile uint16_t CR2;
	uint16_t reserved4;
	volatile uint16_t CR3;
	uint16_t reserved5;
	volatile uint16_t GTPR;
	uint16_t reserved6;
};

/**
 * USART status flags for all other chips.
 * Defined here because of inconsistency of this names in ST headers
 */
enum : uint16_t
{
	USART_FLAG_PE   = 0x0001,
	USART_FLAG_FE   = 0x0002,
	USART_FLAG_NE   = 0x0004,
	USART_FLAG_ORE  = 0x0008,
	USART_FLAG_IDLE = 0x0010,
	USART_FLAG_RXNE = 0x0020,
	USART_FLAG_TC   = 0x0040,
	USART_FLAG_TXE  = 0x0080,
	USART_FLAG_LBD  = 0x0100,
	USART_FLAG_CTS  = 0x0200,
};

#endif


/**
 * USART driver
 */
template<UartNum uartNum>
class UartDriver
{
private:
	typedef UartTraits<uartNum> Traits;
public:
	static const IRQn USARTx_IRQn = Traits::USARTx_IRQn;
	enum { USARTx_BASE            = Traits::USARTx_BASE };
	enum { USARTx_REMAP           = Traits::USARTx_REMAP };
	enum { USARTx_REMAP_PARTIAL   = Traits::USARTx_REMAP_PARTIAL };
	enum { BUS_FREQ               = Traits::BUS_FREQ };
	enum { BUS_FREQ_MUL           = Traits::BUS_FREQ_MUL };

	static IOStruct<USARTx_BASE, USARTx_TypeDef> USARTx;

	INLINE static void EnableClocks()    { Traits::EnableClocks(); }
	INLINE static void DisableClocks()   { Traits::DisableClocks(); }
	INLINE static void Reset()           { Traits::Reset(); }
	INLINE static void Enable()          { USARTx->CR1 |= USART_CR1_UE; }
	INLINE static void Disable()         { USARTx->CR1 &= ~USART_CR1_UE; }

	INLINE static void SetBaudrate(Baudrate value, uint32_t busFreq = BUS_FREQ)
		{ USARTx->BRR = (static_cast<unsigned long long>(busFreq) * BUS_FREQ_MUL + value/2) / value;}
	INLINE static Baudrate GetBaudrate(uint32_t busFreq = BUS_FREQ)
		{ return static_cast<unsigned long long>(busFreq) * BUS_FREQ_MUL / USARTx->BRR; }

#if (defined STM32TPL_STM32L0XX) || (defined STM32TPL_STM32F0XX) || (defined STM32TPL_STM32F3XX) || (defined STM32TPL_STM32H7XX)
	INLINE static uint32_t Status()                 { return USARTx->ISR; }
	INLINE static void ClearStatus(uint32_t flags)  { USARTx->ICR = flags; }
	INLINE static uint32_t ReadData()               { return USARTx->RDR; }
	INLINE static void WriteData(uint8_t data)      { USARTx->TDR = data; }
#else
	INLINE static uint16_t Status()                 { return USARTx->SR; }
	INLINE static void ClearStatus(uint32_t flags)  { USARTx->SR = ~flags; }
	INLINE static uint16_t ReadData()               { return USARTx->DR; }
	INLINE static void WriteData(uint8_t data)      { USARTx->DR = data; }
#endif

	struct RxInterrupt
	{
		static void Enable()    { USARTx->CR1 |= USART_CR1_RXNEIE; }
		static void Disable()   { USARTx->CR1 &= ~USART_CR1_RXNEIE; }
		static bool IsEnabled() { return USARTx->CR1 & USART_CR1_RXNEIE; }
		static bool Fired()     { return Status() & USART_FLAG_RXNE; }
	};

	struct TxInterrupt
	{
		static void Enable()    { USARTx->CR1 |= USART_CR1_TXEIE; }
		static void Disable()   { USARTx->CR1 &= ~USART_CR1_TXEIE; }
		static bool IsEnabled() { return USARTx->CR1 & USART_CR1_TXEIE; }
		static bool Fired()     { return Status() & USART_FLAG_TXE; }
	};

	struct TcInterrupt
	{
		static void Enable()    { USARTx->CR1 |= USART_CR1_TCIE; }
		static void Disable()   { USARTx->CR1 &= ~USART_CR1_TCIE; }
		static bool IsEnabled() { return USARTx->CR1 & USART_CR1_TCIE; }
		static bool Fired()     { return Status() & USART_FLAG_TC; }
		static void Clear()     { ClearStatus(USART_FLAG_TC); }
	};

public:
	INLINE operator uint8_t() { return ReadData(); }
};


} // namespace UART
} // namespace STM32


#endif // STM32TPL_STM32_UART_DRIVER_H_INCLUDED
